Avnet-Silica-team/NBIOTBG96SHIELD-Azure-example/Projects/Multi/Applications/Azure_Sns_DM/Src/platform_STM32Cube_NucleoF429ZI.c
  /* Configure the System clock */
  SystemClock_Config();

#ifdef AZURE_ENABLE_PRINTF
  /* UART Initialization */
  if(UART_Global_Init()!=HAL_OK) {
    STM32_Error_Handler();
  } else {
    AZURE_PRINTF("UART Initialized\r\n");
  }
#endif /* AZURE_ENABLE_PRINTF */
  /* I2C Initialization */
  if(I2C_Global_Init()!=HAL_OK) {
    STM32_Error_Handler();
  } else {
    AZURE_PRINTF("I2C  Initialized\r\n");
  }
  
  /* Initialize button */
  BSP_PB_Init(BUTTON_KEY, BUTTON_MODE_EXTI);

  /* Initialize LED */
  BSP_LED_Init(LED2);

  AZURE_PRINTF("\r\nSTMicroelectronics %s:\r\n"
         "\tVersion %c.%c.%c\r\n"
         "\tSTM32F429ZI-Nucleo board"
          "\r\n",
          AZURE_PACKAGENAME,
          AZURE_VERSION_MAJOR,AZURE_VERSION_MINOR,AZURE_VERSION_PATCH);

  AZURE_PRINTF("\tAzure SDK Version %s\r\n",IOTHUB_SDK_VERSION);

  /* Reset all the Target's Features */
  memset(&TargetBoardFeatures, 0, sizeof(TargetFeatures_t));
  /* Discovery and Intialize all the Target's Features */
  Init_MEM1_Sensors();

  AZURE_PRINTF("\t(HAL %ld.%ld.%ld_%ld)\r\n"
        "\tCompiled %s %s"
#if defined (__IAR_SYSTEMS_ICC__)
        " (IAR)\r\n"
#elif defined (__CC_ARM)
        " (KEIL)\r\n"
#elif defined (__GNUC__)
        " (openstm32)\r\n"
#endif
           ,
           HAL_GetHalVersion() >>24,
          (HAL_GetHalVersion() >>16)&0xFF,
          (HAL_GetHalVersion() >> 8)&0xFF,
           HAL_GetHalVersion()      &0xFF,
         __DATE__,__TIME__);

  AZURE_PRINTF("\tOTA with one HTTP HEAD + Multiple HTTP one GET of %dBytes\r\n",FOTA_CHUNK_SIZE);

  if(TargetBoardFeatures.HWAdvanceFeatures) {
    InitHWFeatures();
  }

  /* Check the BootLoader Compliance */
  if(CheckBootLoaderCompliance()) {
    AZURE_PRINTF("BootLoader Compliant with FOTA procedure\r\n");
  } else {
    AZURE_PRINTF("Err: BootLoader NOT Compliant with FOTA procedure\r\n");
    AzureExit(AZURE_ERR_BL_COMPLIANCE);
  }

  /* Set Full Scale to +/-2g */
  (TargetBoardFeatures.SnsAltFunc ? BSP_ACCELERO_Set_FS_Value_IKS01A2 : BSP_ACCELERO_Set_FS_Value)(TargetBoardFeatures.HandleAccSensor,2.0f);

  /* initialize timers */
  InitTimers();
  AZURE_PRINTF("Init Application's Timers\r\n");

  /* Initialize random number generartion */
  TargetBoardFeatures.RngHandle.Instance = RNG;
  HAL_RNG_Init(&TargetBoardFeatures.RngHandle);
  AZURE_PRINTF("Init Random Number Generator\r\n");
    
  /* Enabling HW Features... FreeFall */
  EnableHWFreeFall();
  
  /* Check if NFC is present */
  if(TT4_Init() == SUCCESS) {
    AZURE_PRINTF("X-NUCLEO-NFC01A1 is present\r\n");
    TargetBoardFeatures.NFCInitialized = 1;
  }

  {
    int32_t CounterButtonPress=0;
    char console_input[128];
    int32_t NecessityToSaveMMD=0;

    MDM_knownGMD_t known_MetaData[]={
      {GMD_ETH,sizeof(AzureEthConfiguration_t)},
#ifndef AZURE_ENABLE_REGISTRATION
      {GMD_AZURE,sizeof(AzureConnection_t)},
#endif /* AZURE_ENABLE_REGISTRATION */
      {GMD_END    ,0}/* THIS MUST BE THE LAST ONE */
    };
    
    /* Initialize the MetaDataManager */
    InitMetaDataManager((void *)&known_MetaData,MDM_DATA_TYPE_GMD,NULL);

    /* Recall the Eth Configuration saved */
    memset(&EthConfiguration,0,sizeof(AzureEthConfiguration_t));
    MDM_ReCallGMD(GMD_ETH,(void *)&EthConfiguration);
    
    if((EthConfiguration.macAddress[0]==0) &
       (EthConfiguration.macAddress[1]==0) &
       (EthConfiguration.macAddress[2]==0) &
       (EthConfiguration.macAddress[3]==0) &
       (EthConfiguration.macAddress[4]==0) &
       (EthConfiguration.macAddress[5]==0)) {

      AZURE_PRINTF("Eth Configuration not initialized->Assign default values\r\n");
      /* Assign default values */
      EthConfiguration.ipaddress[0] = IP_ADDR0;
      EthConfiguration.ipaddress[1] = IP_ADDR1;
      EthConfiguration.ipaddress[2] = IP_ADDR2;
      EthConfiguration.ipaddress[3] = IP_ADDR3;

      EthConfiguration.gwaddress[0] = GW_ADDR0;
      EthConfiguration.gwaddress[1] = GW_ADDR1;
      EthConfiguration.gwaddress[2] = GW_ADDR2;
      EthConfiguration.gwaddress[3] = GW_ADDR3;

      EthConfiguration.use_dhcp = true;

      EthConfiguration.macAddress[0] = macAddress[0] = MAC_ADDR0;
      EthConfiguration.macAddress[1] = macAddress[1] = MAC_ADDR1;
      EthConfiguration.macAddress[2] = macAddress[2] = MAC_ADDR2;
      EthConfiguration.macAddress[3] = macAddress[3] = MAC_ADDR3;
      EthConfiguration.macAddress[4] = macAddress[4] = MAC_ADDR4;
      EthConfiguration.macAddress[5] = macAddress[5] = MAC_ADDR5;
    } else {
      macAddress[0] = EthConfiguration.macAddress[0];
      macAddress[1] = EthConfiguration.macAddress[1];
      macAddress[2] = EthConfiguration.macAddress[2];
      macAddress[3] = EthConfiguration.macAddress[3];
      macAddress[4] = EthConfiguration.macAddress[4];
      macAddress[5] = EthConfiguration.macAddress[5];
    }

    /* Print out the ETH configuration */
    AZURE_PRINTF("    MAC addr saved is %02x:%02x:%02x:%02x:%02x:%02x\r\n",
               macAddress[0],macAddress[1],macAddress[2],
               macAddress[3],macAddress[4],macAddress[5]);

    if(EthConfiguration.use_dhcp == false) {
      AZURE_PRINTF("    IP addr saved is %d.%d.%d.%d\r\n",
                   EthConfiguration.ipaddress[0],EthConfiguration.ipaddress[1],EthConfiguration.ipaddress[2],EthConfiguration.ipaddress[3]);
      AZURE_PRINTF("    GW addr saved is %d.%d.%d.%d\r\n",
                   EthConfiguration.gwaddress[0],EthConfiguration.gwaddress[1],EthConfiguration.gwaddress[2],EthConfiguration.gwaddress[3]);
    } else {
      AZURE_PRINTF("    IP addr with DHCP\r\n");
    }

    {
      int32_t CountOn,CountOff;
      AZURE_PRINTF("\r\nWait 3 seconds for allowing User Button Control for changing it\r\n");
      for(CountOn=0;CountOn<3;CountOn++) {
        BSP_LED_On(LED2);
        for(CountOff=0;CountOff<10;CountOff++) {
          if(CountOff==2) {
            BSP_LED_Off(LED2);
          }
          /* Handle user button */
          if(ButtonPressed) {
            CounterButtonPress++;
            ButtonPressed=0;
            goto INSERT_LABEL1;
          }
          HAL_Delay(100);
        }
      }
    }
INSERT_LABEL1:
      if(CounterButtonPress) {
        /* Enabling UART interaction */
        AZURE_PRINTF("\r\nDo you want to change them?(y/n)\r\n");
        scanf("%s",console_input);
        if(console_input[0]=='y') {
          int32_t ReadFromTerminal=1;

        /* If the NFC is present */
        if(TargetBoardFeatures.NFCInitialized) {
          AZURE_PRINTF("\tDo you want to read them from NFC?(y/n)\r\n");
          scanf("%s",console_input);
          if(console_input[0]=='y') {
            ReadFromTerminal=0;
            ReadNFC(&EthConfiguration);
          }
        }

        if(ReadFromTerminal) {
          ReadUART(&EthConfiguration);
        }

        /* Save the ETH Configuration on MetaDataManager */
        MDM_SaveGMD(GMD_ETH,(void *)&EthConfiguration);

        /* We need to save the MetaDataManager */
        NecessityToSaveMMD=1;
      }
    }
#ifndef AZURE_ENABLE_REGISTRATION
    AZURE_PRINTF("--------------------------\r\n");
    AZURE_PRINTF("|   Connection String    |\r\n");
    AZURE_PRINTF("--------------------------\r\n");

    connectionString = AzureConnection.ConnectionString;

    /* Recall Connection String from Meta Data Manager */
    memset(&AzureConnection,0,sizeof(AzureConnection_t));
    MDM_ReCallGMD(GMD_AZURE,(void *)&AzureConnection);
    {
      int32_t ReadFromTerminal=1;
      CounterButtonPress=0;

