Avnet-Silica-team/NBIOTBG96SHIELD-Azure-example/Projects/Multi/Applications/Azure_Sns_DM/Src/platform_STM32Cube_NucleoF429ZI.c
    /* gethostbyname: get the server's DNS entry */
    server = gethostbyname(ipAddress);
    if (server == NULL) {
      AZURE_PRINTF("ERROR, no such host as %s\r\n", ipAddress);
      goto RETRY;
    }
    
    /* build the server's Internet address */
    memset((char *) &address, 0, sizeof(address));
    memcpy((char *)&address.sin_addr.s_addr,
           (char *)server->h_addr, server->h_length);
    address.sin_family = AF_INET;
    address.sin_port = htons(tcpPort);
    
    /* connect: create a connection with the server */
    if (connect(socketHandle, (struct sockaddr*)&address, sizeof(address)) < 0) {
      AZURE_PRINTF("ERROR connecting\r\n");
      goto RETRY;
    }

    /* write message to socket */
    if (write(socketHandle, msg, strlen(msg)) < 0) {
      AZURE_PRINTF("ERROR writing to socket");
      goto RETRY;
    }
    
    /* read reply from server */
    if ((read(socketHandle, buf, 8))< 0) {
      AZURE_PRINTF("ERROR reading from socket");
      goto RETRY;
    }
    
    buf[4]='\0';
    
    epochTimeToSetForSystem = SynchronizationAgentConvertNTPTime2EpochTime((uint8_t*)buf,4);
    if (TimingSystemSetSystemTime(epochTimeToSetForSystem)== 0){
      AZURE_PRINTF("Error Failed to set system time. \r\n");
      goto RETRY;
    } else {
      AZURE_PRINTF("Set UTC Time: %s\r\n",(get_ctime(&epochTimeToSetForSystem)));
    }
    
  RETRY:
    /* close socket */
    close(socketHandle);

    if(HAL_RTCEx_BKUPRead(&TargetBoardFeatures.RtcHandle, RTC_BKP_DR0) != 0x32F2) {

      AZURE_PRINTF("I'll try again to connect to NTP server in 4 seconds\r\n");
      HAL_Delay(4000);
      NumRentryNTP++;
      if (NumRentryNTP == NTP_MAX_RETRIES){
        NumRentryNTP = 0;
        
        switch(NTP_Server) {
        case NTP_DEFAULT:
          AZURE_PRINTF("NTP backup 1\r\n");
          NTP_Server = NTP_BACKUP1;
          break;
        case NTP_BACKUP1:
          AZURE_PRINTF("NTP backup 2\r\n");
          NTP_Server = NTP_BACKUP2;
          break;
        case NTP_BACKUP2:
          AZURE_PRINTF("NTP Default\r\n");
          NTP_Server = NTP_DEFAULT;
          break;
        default:
          AzureExit(AZURE_ERR_NTP);
        }
      }
    }
  }
  /* RTC is ok */
  {
    uint8_t aShowTime[50] = {0};
    uint8_t aShowDate[50] = {0};
    RTC_CalendarShow(aShowTime,aShowDate);
    AZURE_PRINTF("Init Real Time Clock %s %s\r\n",aShowDate,aShowTime);
  }
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void STM32_Error_Handler(void)
{
  /* User may add here some code to deal with this error */
  while(1){
  }
}

/**
 * @brief  EXTI line detection callback.
 * @param  uint16_t GPIO_Pin Specifies the pins connected EXTI line
 * @retval None
 */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  switch(GPIO_Pin){
  case KEY_BUTTON_PIN:
    ButtonPressed = 1;
    break;
   case M_INT1_PIN:
   case LSM6DSL_INT1_O_PIN:
    MEMSInterrupt=1;
    break;
  }
}

/**
  * @brief  function called after the end of GET/HEAD request for FOTA
  * @param  void* context type of request (GET/HEAD)
  * @param  IO_SEND_RESULT send_result Results of the request (IO_SEND_OK/...)
  * @retval None
  */
static void onSendCompleteFOTA(void* context, IO_SEND_RESULT send_result)
{
  int32_t *TypeOfRequest = (int32_t *)context;
  if (send_result != IO_SEND_OK){
    AZURE_PRINTF("onSendCompleteFOTA Err for HTTP %s\r\n",((*TypeOfRequest) == HTTP_HEAD_REQUEST) ? "HEAD" : "GET"); 
  }
}

/**
  * @brief  function called After the Socket open request  for FOTA
  * @param  void* context (not Used)
  * @param  IO_OPEN_RESULT open_result Results of the open command (IO_OPEN_OK/...)
  * @retval None
  */
static void onOpenCompleteFOTA(void* context, IO_OPEN_RESULT open_result)
{  
  if (open_result != IO_OPEN_OK){
    AZURE_PRINTF("onOpenCompleteFOTA Err\r\n"); 
  }
}

/**
  * @brief  function called when we are receiving data on the socket open for FOTA
  * @param  void* context type of request (GET/HEAD)
  * @param  unsigned char* data_ptr pointer to the data received
  * @param  size_t size size to the data received
  * @retval None
  */
static void onBytesReceivedFOTA(void* context, const unsigned char* data_ptr, size_t size)
{
  int32_t *TypeOfRequest = (int32_t *)context; 

  static uint32_t SizeOfUpdate=0;

  if((*TypeOfRequest) == HTTP_HEAD_REQUEST) {
    /* for the HEAD Request */
    uint8_t *StartAddress=NULL;
    OTAStatus = OTA_STATUS_RUNNIG;
#ifdef DEBUG_OTA_RECEIVE
    AZURE_PRINTF("message from HEAD Request Size=%d\r\n",size);
#endif /* DEBUG_OTA_RECEIVE */

    /* Make the parsing of the header */
    if(FullOTASize==0) {
      /* Search the String "Content-Range: bytes" */
      StartAddress = (uint8_t *) strstr( (char *) data_ptr, "Content-Range: bytes");
      if(StartAddress!=NULL) {
          StartAddress = (uint8_t *) strstr((char *) StartAddress, "/");
          if(StartAddress!=NULL) {
            StartAddress++;
            FullOTASize = atoi((char *) StartAddress);
            AZURE_PRINTF("(Content-Range:) Full OTA size=%ld\r\n",FullOTASize);
          } else {
            AZURE_PRINTF("Err... retriving the Full OTA Size...(Content-Range: bytes)\r\n");
            OTAStatus = OTA_STATUS_ERROR;
            return;
          }
      } else {
        /* Search the String "Content-Lenght:" */
        StartAddress = (uint8_t *) strstr( (char *) data_ptr, "Content-Length:");
        if(StartAddress!=NULL) {
          StartAddress+=16; // for moving to the end of "Content-Length: "
          FullOTASize = atoi((char *) StartAddress);
          AZURE_PRINTF("(Content-Length:) Full OTA size=%ld\r\n",FullOTASize);
        } else {
          AZURE_PRINTF("Err... retriving the Full OTA Size...(Content-Length:)\r\n");
          OTAStatus = OTA_STATUS_ERROR;
          return;
        }
      }
      /* Padding the OTA size for L476 Board */
    } else {
#ifdef DEBUG_OTA_RECEIVE
      AZURE_PRINTF("Consuming remaining bytes from HEAD request\r\n");
#endif /* DEBUG_OTA_RECEIVE */
      /* Search the end of HEAD request... */
      StartAddress = (uint8_t *) strstr( (char *) data_ptr, "\r\n\r\n");      
      if(StartAddress!=NULL) {
        OTAStatus = OTA_STATUS_END;
      }
    }
  } else {
    /* for the GET Request */
    uint8_t *StartAddress=NULL;
    uint32_t RealMessageSize=0;

#define MCR_OTA_DOUBLE_WORLD(size) UpdateFWBlueMS(&SizeOfUpdate,StartAddress, size,1)
    
    if(SizeOfUpdate==0) {
      /* Search the Content-Length: */
     StartAddress = (uint8_t *) strstr( (char *) data_ptr, "Content-Length:");
      if(StartAddress!=NULL) {
        StartAddress+=16; // for moving to the end of "Content-Length: "
        SizeOfUpdate = atoi((char *) StartAddress);
#ifdef DEBUG_OTA_RECEIVE
        AZURE_PRINTF("Chunk OTA size=%ld\r\n",SizeOfUpdate);
#endif /* DEBUG_OTA_RECEIVE */
      } else {
#ifdef DEBUG_OTA_RECEIVE
        AZURE_PRINTF("Starting OTA not found.. move to next chunk\r\n");
#endif /* DEBUG_OTA_RECEIVE */
      }
    }

    /* If we had found the Chunk OTA Size */
    if(SizeOfUpdate!=0) {
      if(OTAStatus==OTA_STATUS_START) {
        /* Search the real Start Postion skipping the Banner */
        StartAddress = (uint8_t *) strstr( (char *) data_ptr, "\r\n\r\n");
        if(StartAddress!=NULL) {
          StartAddress += 4;
          RealMessageSize= size - (StartAddress - data_ptr);
#ifdef DEBUG_OTA_RECEIVE
          AZURE_PRINTF("RealMessageSize=%d\r\n",RealMessageSize);
#endif /* DEBUG_OTA_RECEIVE */

          OTAStatus=OTA_STATUS_RUNNIG;

