Avnet-Silica-team/NBIOTBG96SHIELD-Azure-example/Projects/Multi/Applications/Azure_Sns_DM/Src/platform_STM32Cube_NucleoF429ZI.c
  /* Infinite loop */
  while (1){
  }
}
#endif

/*-------------------------------------------------------------------*/


/**
  * @brief  Initializes the lwIP stack
  * @param  AzureEthConfiguration_t EthConfiguration Ethernet configuration
  * @retval None
  */
static void Netif_Config(AzureEthConfiguration_t EthConfiguration)
{
  ip_addr_t ipaddr;
  ip_addr_t netmask;
  ip_addr_t gw;	
  
  /* IP address setting */
  IP4_ADDR(&ipaddr, EthConfiguration.ipaddress[0], EthConfiguration.ipaddress[1], EthConfiguration.ipaddress[2], EthConfiguration.ipaddress[3]);
  IP4_ADDR(&netmask, NETMASK_ADDR0, NETMASK_ADDR1 , NETMASK_ADDR2, NETMASK_ADDR3);
  IP4_ADDR(&gw, EthConfiguration.gwaddress[0], EthConfiguration.gwaddress[1], EthConfiguration.gwaddress[2], EthConfiguration.gwaddress[3]);
  
  /* - netif_add(struct netif *netif, struct ip_addr *ipaddr,
  struct ip_addr *netmask, struct ip_addr *gw,
  void *state, err_t (* init)(struct netif *netif),
  err_t (* input)(struct pbuf *p, struct netif *netif))
  
  Adds your network interface to the netif_list. Allocate a struct
  netif and pass a pointer to this structure as the first argument.
  Give pointers to cleared ip_addr structures when using DHCP,
  or fill them with sane numbers otherwise. The state pointer may be NULL.
  
  The init function pointer must point to a initialization function for
  your ethernet netif interface. The following code illustrates it's use.*/
  
  netif_add(&gnetif, &ipaddr, &netmask, &gw, NULL, &ethernetif_init, &tcpip_input);
  
  /*  Registers the default network interface. */
  netif_set_default(&gnetif);
  
  if (netif_is_link_up(&gnetif))
  {
    /* When the netif is fully configured this function must be called.*/
    netif_set_up(&gnetif);
  }
  else
  {
    /* When the netif link is down this function must be called */
    netif_set_down(&gnetif);
  }
}

/**
  * @brief  Notify the User about the network interface config status
  * @param  netif: the network interface
  * @param  EthConfiguration: the Ethernet configuration
  * @retval None
  */
void User_notification(struct netif *netif,AzureEthConfiguration_t EthConfiguration) 
{
  if (netif_is_up(netif))
  {
    /* Update DHCP state machine */
    if ( EthConfiguration.use_dhcp )
      DHCP_state = DHCP_START;
  }
  else
  {  
    /* Update DHCP state machine */
    if ( EthConfiguration.use_dhcp )
      DHCP_state = DHCP_LINK_DOWN;
  } 
}

/**
* @brief  DHCP Process
* @param  argument: network interface
* @retval None
*/
void DHCP_init(void const * argument)
{
  struct netif *netif = (struct netif *) argument;
  ip_addr_t ipaddr;
  ip_addr_t netmask;
  ip_addr_t gw;
  struct dhcp *dhcp;
  uint32_t IPaddress;
  
  for (;;)
  {
    switch (DHCP_state)
    {
    case DHCP_START:
      {
        ip_addr_set_zero_ip4(&netif->ip_addr);
        ip_addr_set_zero_ip4(&netif->netmask);
        ip_addr_set_zero_ip4(&netif->gw);       
        dhcp_start(netif);
        DHCP_state = DHCP_WAIT_ADDRESS;
      }
      break;
      
    case DHCP_WAIT_ADDRESS:
      {                
        if (dhcp_supplied_address(netif)) 
        {
          DHCP_state = DHCP_ADDRESS_ASSIGNED;	
          /* Read the new IP address */
          IPaddress = netif->ip_addr.addr;
          AZURE_PRINTF("IPaddress = %ld.%ld.%ld.%ld\r\n",
                 IPaddress&0xFF,
                 (IPaddress>> 8)&0xFF,
                 (IPaddress>>16)&0xFF,
                 (IPaddress>>24)&0xFF                 
                   );
          
          return;
        }
        else
        {
          dhcp = (struct dhcp *)netif_get_client_data(netif, LWIP_NETIF_CLIENT_DATA_INDEX_DHCP);

          /* DHCP timeout */
          if (dhcp->tries > MAX_DHCP_TRIES)
          {
            DHCP_state = DHCP_TIMEOUT;
            
            /* Stop DHCP */
            dhcp_stop(netif);
            
            /* Static address used */
            IP_ADDR4(&ipaddr, IP_ADDR0 ,IP_ADDR1 , IP_ADDR2 , IP_ADDR3 );
            IP_ADDR4(&netmask, NETMASK_ADDR0, NETMASK_ADDR1, NETMASK_ADDR2, NETMASK_ADDR3);
            IP_ADDR4(&gw, GW_ADDR0, GW_ADDR1, GW_ADDR2, GW_ADDR3);
            netif_set_addr(netif, ip_2_ip4(&ipaddr), ip_2_ip4(&netmask), ip_2_ip4(&gw));
            
          }
        }
      }
      break;
  case DHCP_LINK_DOWN:
    {
      /* Stop DHCP */
      dhcp_stop(netif);
      DHCP_state = DHCP_OFF; 
    }
    break;
    default: break;
    }
    
    /* wait 250 ms */
    osDelay(250);
  }
}
                                     
/**
* @brief  If NFC is present, read MAC and IP/GW addresses
* @param  EthConfiguration: Pointer to the Ethernet configuration
* @retval None
*/
static void ReadNFC(AzureEthConfiguration_t *EthConfiguration)
{
  NDEF_Text_info_t TextInfo;
  char *StartAddress;
  char InputString[18];

  if(TT4_ReadTextToken(&TextInfo) == SUCCESS) {
    //AZURE_PRINTF("Text content: '%s'\r\n",TextInfo.text);

    if ( (StartAddress=strstr(TextInfo.text,"MAC")) != NULL ) {
      StartAddress+=4;
      strncpy(InputString,StartAddress,17);
      InputString[17]='\0';
      sscanf(InputString,"%hhx:%hhx:%hhx:%hhx:%hhx:%hhx",
             macAddress  ,macAddress+1,macAddress+2,
             macAddress+3,macAddress+4,macAddress+5);

      memcpy(EthConfiguration->macAddress,macAddress,6);
    } else {
      AZURE_PRINTF("MAC address not found\r\n");
    }

    if ( (StartAddress=strstr(TextInfo.text,"IP")) != NULL ){
      StartAddress+=3;
      strncpy(InputString,StartAddress,15);
      InputString[15]='\0';
      if ( !strcmp(InputString,"dynamic") || !strcmp(InputString,"dhcp") ){
          EthConfiguration->use_dhcp = true;
          memset(EthConfiguration->ipaddress,0,4*4);
      } else {
        EthConfiguration->use_dhcp = false;
        sscanf(InputString,"%d.%d.%d.%d",&EthConfiguration->ipaddress[0],&EthConfiguration->ipaddress[1],
               &EthConfiguration->ipaddress[2],&EthConfiguration->ipaddress[3]);
      }
    } else {
      AZURE_PRINTF("IP address not found\r\n");
    }
    
    if (EthConfiguration->use_dhcp == false) 
    {
      if ( (StartAddress=strstr(TextInfo.text,"GW")) != NULL ){
        StartAddress+=3;
        strncpy(InputString,StartAddress,15);
        InputString[15]='\0';
        sscanf(InputString,"%d.%d.%d.%d",&EthConfiguration->gwaddress[0],&EthConfiguration->gwaddress[1],
               &EthConfiguration->gwaddress[2],&EthConfiguration->gwaddress[3]);
      } else {
        AZURE_PRINTF("GW address not found\r\n");
      }
    }
    
  } else {
    AZURE_PRINTF("Read nothing\r\n");
  }

  AZURE_PRINTF("    MAC addr is %02x:%02x:%02x:%02x:%02x:%02x\r\n",
               macAddress[0],macAddress[1],macAddress[2],
               macAddress[3],macAddress[4],macAddress[5]);

